SELECT "Н_ЛЮДИ"."ИМЯ",
       "Н_СЕССИЯ"."ЧЛВК_ИД"
FROM "Н_ЛЮДИ"
         INNER JOIN "Н_СЕССИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ИД" < 100865 AND
        "Н_СЕССИЯ"."ЧЛВК_ИД" > 100622;

SELECT "Н_ЛЮДИ"."ОТЧЕСТВО",
       "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД",
       "Н_УЧЕНИКИ"."ГРУППА"
FROM "Н_ЛЮДИ"
         INNER JOIN "Н_ОБУЧЕНИЯ" ON "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
         INNER JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "Н_ЛЮДИ"."ОТЧЕСТВО" < 'Владимирович' AND
        "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" < 113409 AND
        "Н_УЧЕНИКИ"."ГРУППА" > '5100';

SELECT COUNT("Н_УЧЕНИКИ"."ИД")
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         JOIN "Н_ОТДЕЛЫ" ON "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД" AND
                            "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ'
         JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД" AND
                          ("Н_ЛЮДИ"."ОТЧЕСТВО" is null or "Н_ЛЮДИ"."ОТЧЕСТВО" = '.');

SELECT "Н_ГРУППЫ_ПЛАНОВ"."ГРУППА"
FROM "Н_ГРУППЫ_ПЛАНОВ"
         JOIN "Н_ПЛАНЫ" ON "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         JOIN "Н_УЧЕНИКИ" ON "Н_ГРУППЫ_ПЛАНОВ"."ГРУППА" = "Н_УЧЕНИКИ"."ГРУППА" AND
                             "НАЧАЛО" < '01.01.2012' AND
                             "КОНЕЦ" >= '01.01.2011'
WHERE(SELECT "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ"
      FROM "Н_ОТДЕЛЫ"
      WHERE "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ') = 'КТиУ'
GROUP BY "Н_ГРУППЫ_ПЛАНОВ"."ГРУППА"
HAVING COUNT(*) < 10;

SELECT "Н_ЛЮДИ"."ИД",
       "ФАМИЛИЯ",
       "ИМЯ",
       "ОТЧЕСТВО",
       AVG(CAST("ОЦЕНКА" AS NUMERIC)) AS "СРЕДНЯЯ_ОЦЕНКА"
FROM "Н_ЛЮДИ"
         JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД" AND
                             "Н_УЧЕНИКИ"."ГРУППА" = '4100'
         JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД" AND
                               "ОЦЕНКА" NOT IN('осв', 'неявка', 'зачет', 'незач')
GROUP BY "Н_ЛЮДИ"."ИД",
         "ФАМИЛИЯ",
         "ИМЯ",
         "ОТЧЕСТВО"
HAVING AVG(CAST("ОЦЕНКА" AS NUMERIC)) > (SELECT MIN(EXP.MARK)
                                         FROM
                                             (
                                                 SELECT AVG(CAST("ОЦЕНКА" AS NUMERIC)) AS MARK
                                                 FROM "Н_УЧЕНИКИ"
                                                          JOIN "Н_ВЕДОМОСТИ" ON "Н_УЧЕНИКИ"."ГРУППА" = '1101' AND
                                                                                "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" AND
                                                                                "ОЦЕНКА" NOT IN('осв', 'неявка', 'зачет', 'незач')
                                             ) EXP);

SELECT "ГРУППА",
       "ЧЛВК_ИД",
       "ФАМИЛИЯ",
       "ИМЯ",
       "ОТЧЕСТВО",
       "В_СВЯЗИ_С"
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE EXISTS(SELECT "ИД"
             FROM "Н_ФОРМЫ_ОБУЧЕНИЯ"
             WHERE "НАИМЕНОВАНИЕ" = 'Очная' AND
                     "НАЧАЛО" = '01.09.2012');

SELECT "ИД",
       "ФАМИЛИЯ",
       "ИМЯ",
       "ОТЧЕСТВО"
FROM "Н_ЛЮДИ" AS people
WHERE NOT EXISTS(SELECT *
                 FROM "Н_УЧЕНИКИ"
                          JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
                          JOIN "Н_ОТДЕЛЫ" ON "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД" AND
                                             "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ'
                          JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
                 WHERE "Н_УЧЕНИКИ"."ЧЛВК_ИД" = people."ИД");
