--1--
SELECT "Н_ЛЮДИ"."ИД", "Н_СЕССИЯ"."ИД"
FROM "Н_ЛЮДИ"
         RIGHT JOIN "Н_СЕССИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ИД" = 142095
  AND "Н_СЕССИЯ"."ИД" > 14369
  AND "Н_СЕССИЯ"."ИД" = 14;

--2--
SELECT "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД", "Н_УЧЕНИКИ"."ГРУППА"
FROM "Н_ЛЮДИ"
         INNER JOIN "Н_ОБУЧЕНИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
         INNER JOIN "Н_УЧЕНИКИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ИМЯ" = 'Ярослав'
  AND "Н_ОБУЧЕНИЯ"."НЗК" = '933232';
